Revit 2027 API
ParameterTypeId.AnalyticConstructionLookupTable Property
 "Analytic Construction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticConstructionLookupTable { get; }
Public Shared ReadOnly Property AnalyticConstructionLookupTable As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticConstructionLookupTable {
	ForgeTypeId^ get ();
}
static member AnalyticConstructionLookupTable : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace